function Dsy() {
    this.Items = {};
}
Dsy.prototype.add = function (id, iArray) {
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function (id) {
    if (typeof(this.Items[id]) == "undefined") return false;
    return true;
}

function change(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(s[i]).selectedIndex - 1));}
    ;
    var ss = document.getElementById(s[v]);
    with (ss) {
        length = 0;
        options[0] = new Option(opt0[v],'');
        if (v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str)) {
                ar = dsy.Items[str];
                for (i = 0; i < ar.length; i++)options[length] = new Option(ar[i], ar[i]);
                if (v)options[0].selected = true;
            }
        }
        if (++v < s.length) {change(v);}
    }
}
function preselect(p_key,city,tomn) {
    //alert(p_key);
    var index;

    var provinces = new Array("北京市", "天津市", "上海市", "重庆市", "河北省", "山西省", "内蒙古", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西省", "海南省", "四川省", "贵州省", "云南省", "西藏", "陕西省", "甘肃省", "青海省", "宁夏", "新疆", "香港", "澳门", "台湾省");
    var cnt = provinces.length;
    //alert(cnt);
    for (i = 0; i < cnt; i++) {
        if (p_key == provinces[i]) {
            index = i;
            break;
        }
    }
    if (index < provinces.length) {
        document.getElementById(s[0]).selectedIndex = index + 1;
        change(1);
    }

	$("#s2 ").val(city);
	change(2);
	$("#s3 ").val(tomn);
}

var dsy = new Dsy();

dsy.add("0_0_0", ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"]);
dsy.add("0_0", ["北京市"]);

dsy.add("0_1_0", ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "蓟县", "宁河县",  "静海县"]);
dsy.add("0_1", ["天津市"]);

dsy.add("0_2_0", ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"]);
dsy.add("0_2", ["上海市"]);

dsy.add("0_3_0", ["渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "万州区", "涪陵区", "黔江区", "长寿区", "合川市", "永川区市", "江津市", "南川市", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "垫江县", "武隆县", "丰都县", "城口县", "梁平县", "开县", "巫溪县", "巫山县", "奉节县", "云阳县", "忠县", "石柱土家族自治县", "彭水苗族土家族自治县", "酉阳土家族苗族自治县", "秀山土家族苗族自治县"]);
dsy.add("0_3", ["重庆市"]);

dsy.add("0_4_0", ["长安区", "桥东区", "桥西区", "新华区", "裕华区", "井陉矿区", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "井陉县",  "正定县", "栾城县",  "行唐县", "灵寿县", "高邑县",  "深泽县","赞皇县", "无极县", "平山县", "元氏县", "赵县"]);
dsy.add("0_4_1", ["桥西区", "桥东区", "宣化区", "下花园区", "宣化县", "张家口市宣化区", "张北县","康保县", "沽源县",  "尚义县",  "蔚县", "阳原县", "怀安县",  "万全县", "怀来县", "涿鹿县", "赤城县","崇礼县"]);
dsy.add("0_4_2", ["双桥区", "双滦区", "鹰手营子矿区", "承德县",  "兴隆县",  "平泉县", "滦平县","隆化县","丰宁满族自治县", "宽城满族自治县",  "围场满族蒙古族自治县"]);
dsy.add("0_4_3", ["海港区", "山海关区", "北戴河区", "昌黎县",  "抚宁县","卢龙县","青龙满族自治县"]);
dsy.add("0_4_4", ["路北区", "路南区", "古冶区", "开平区", "丰润区", "丰南区", "遵化市", "迁安市", "滦县", "滦南县", "乐亭县","迁西县",  "玉田县", "唐海县"]);
dsy.add("0_4_5", ["安次区", "广阳区", "霸州市", "三河市", "固安县", "永清县","香河县",  "大城县", "文安县", "大厂回族自治县"]);
dsy.add("0_4_6", ["新市区", "北市区", "南市区", "定州市", "涿州市", "安国市", "高碑店市", "满城县",  "清苑县", "易县","徐水县", "涞源县","定兴县", "顺平县", "唐县",  "望都县", "涞水县", "高阳县", "安新县",  "雄县",  "容城县", "曲阳县","阜平县",  "博野县","蠡县"]);
dsy.add("0_4_7", ["桃城区", "冀州市", "深州市", "枣强县", "武邑县", "武强县","饶阳县","安平县", "故城县", "景县", "阜城县"]);
dsy.add("0_4_8", ["运河区", "新华区", "泊头市", "任丘市", "黄骅市", "河间市", "沧县", "沧州市新华区", "青县", "东光县",  "海兴县","盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县"]);
dsy.add("0_4_9", ["桥东区", "桥西区", "南宫市", "沙河市", "邢台县", "邢台市桥东区", "临城县", "内丘县","柏乡县", "隆尧县",  "任县",  "南和县",  "宁晋县",  "巨鹿县",  "新河县", "广宗县","平乡县",  "威县", "清河县","临西县"]);
dsy.add("0_4_10", ["丛台区", "邯山区", "复兴区", "峰峰矿区", "武安市", "邯郸县", "南堡乡东小屯村", "临漳县", "成安县", "大名县", "涉县", "磁县",  "肥乡县",  "永年县",  "邱县", "鸡泽县",  "广平县", "馆陶县","魏县", "曲周县"]);
dsy.add("0_4", ["石家庄市", "张家口市", "承德市", "秦皇岛市", "唐山市", "廊坊市", "保定市", "衡水市", "沧州市", "邢台市", "邯郸市"]);

dsy.add("0_5_0", ["杏花岭区", "小店区", "迎泽区", "尖草坪区", "万柏林区", "晋源区", "古交市", "清徐县", "阳曲县",  "娄烦县"]);
dsy.add("0_5_1", ["朔城区", "平鲁区", "山阴县", "岱岳乡", "应县",  "右玉县",  "怀仁县"]);
dsy.add("0_5_2", ["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县","灵丘县","浑源县", "左云县", "大同县"]);
dsy.add("0_5_3", ["城区", "矿区", "郊区", "平定县","盂县"]);
dsy.add("0_5_4", ["城区", "郊区", "潞城市", "长治县",  "襄垣县",  "屯留县",  "平顺县", "黎城县", "壶关县", "长子县", "武乡县",  "沁县",  "沁源县"]);
dsy.add("0_5_5", ["城区", "高平市", "泽州县", "沁水县",  "阳城县","陵川县"]);
dsy.add("0_5_6", ["忻府区", "原平市", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县","神池县",  "五寨县", "岢岚县","河曲县",  "保德县", "偏关县"]);
dsy.add("0_5_7", ["榆次区", "介休市", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县","祁县", "平遥县", "灵石县"]);
dsy.add("0_5_8", ["尧都区", "侯马市", "霍州市", "曲沃县", "翼城县", "襄汾县",  "洪洞县",  "古县", "安泽县","浮山县", "吉县","乡宁县","蒲县", "大宁县",  "永和县",  "隰县",  "汾西县"]);
dsy.add("0_5_9", ["离石区", "孝义市", "汾阳市", "文水县", "中阳县", "兴县", "临县",  "方山县","柳林县", "岚县", "交口县", "交城县", "石楼县"]);
dsy.add("0_5_10", ["盐湖区", "永济市", "河津市", "芮城县","临猗县",  "万荣县", "新绛县","稷山县",  "闻喜县","夏县","绛县",  "平陆县", "垣曲县"]);
dsy.add("0_5", ["太原市", "朔州市", "大同市", "阳泉市", "长治市", "晋城市", "忻州市", "晋中市", "临汾市", "吕梁市", "运城市"]);

dsy.add("0_6_0", ["回民区", "新城区", "玉泉区", "赛罕区", "托克托县",  "武川县","和林格尔县",  "清水河县", "土默特左旗"]);
dsy.add("0_6_1", ["昆都仑区", "东河区", "青山区", "石拐区", "白云矿区", "九原区", "固阳县",  "土默特右旗",  "达尔罕茂明安联合旗"]);
dsy.add("0_6_2", ["海勃湾区", "海南区", "乌达区"]);
dsy.add("0_6_3", ["红山区", "元宝山区", "松山区", "宁城县",  "林西县", "阿鲁科尔沁旗", "巴林左旗","巴林右旗", "克什克腾旗", "翁牛特旗",  "喀喇沁旗", "敖汉旗"]);
dsy.add("0_6_4", ["科尔沁区", "霍林郭勒市", "开鲁县", "库伦旗", "奈曼旗","扎鲁特旗", "科尔沁左翼中旗", "科尔沁左翼后旗"]);
dsy.add("0_6_5", ["海拉尔区", "满洲里市", "扎兰屯市", "牙克石市", "根河市", "额尔古纳市", "阿荣旗", "新巴尔虎右旗", "新巴尔虎左旗","陈巴尔虎旗",  "鄂伦春自治旗", "鄂温克族自治旗", "莫力达瓦达斡尔族自治旗"]);
dsy.add("0_6_6", ["东胜区", "达拉特旗", "准格尔旗","鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"]);
dsy.add("0_6_7", ["集宁区", "丰镇市", "卓资县",  "化德县",  "商都县", "兴和县","凉城县", "察哈尔右翼前旗","察哈尔右翼中旗", "察哈尔右翼后旗",  "四子王旗"]);
dsy.add("0_6_8", ["临河区", "五原县","磴口县", "乌拉特前旗", "乌拉特中旗",  "乌拉特后旗",  "杭锦后旗"]);
dsy.add("0_6_9", ["乌兰浩特市", "阿尔山市", "突泉县", "科尔沁右翼前旗",  "科尔沁右翼中旗", "扎赉特旗"]);
dsy.add("0_6_10", ["锡林浩特市", "二连浩特市", "多伦县", "阿巴嘎旗","苏尼特左旗",  "苏尼特右旗","东乌珠穆沁旗",  "西乌珠穆沁旗","太仆寺旗", "镶黄旗", "正镶白旗","正蓝旗"]);
dsy.add("0_6_11", [ "阿拉善右旗", "额济纳旗"]);
dsy.add("0_6", ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "呼伦贝尔市", "鄂尔多斯市", "乌兰察布市", "巴彦淖尔市", "兴安盟", "锡林郭勒盟", "阿拉善盟"]);

dsy.add("0_7_0", ["沈河区", "和平区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "新城子区", "于洪区", "新民市", "辽中县", "康平县", "法库县"]);
dsy.add("0_7_1", ["双塔区", "龙城区", "北票市", "凌源市", "朝阳县", "朝阳市双塔区", "建平县", "喀喇沁左翼蒙古族自治县"]);
dsy.add("0_7_2", ["海州区", "新邱区", "太平区", "清河门区", "细河区", "彰武县",  "阜新蒙古族自治县"]);
dsy.add("0_7_3", ["银州区", "清河区", "调兵山市", "开原市", "铁岭县", "铁岭市银州区", "西丰县",  "昌图县"]);
dsy.add("0_7_4", ["顺城区", "新抚区", "东洲区", "望花区", "抚顺县", "抚顺市顺城区", "新宾满族自治县", "清原满族自治县"]);
dsy.add("0_7_5", ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "桓仁满族自治县"]);
dsy.add("0_7_6", ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "灯塔市", "辽阳县"]);
dsy.add("0_7_7", ["铁东区", "铁西区", "立山区", "千山区", "海城市", "台安县",  "岫岩满族自治县"]);
dsy.add("0_7_8", ["振兴区", "元宝区", "振安区", "凤城市", "东港市", "宽甸满族自治县"]);
dsy.add("0_7_9", ["西岗区", "中山区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "瓦房店市", "普兰店市", "庄河市", "长海县"]);
dsy.add("0_7_10", ["站前区", "西市区", "鲅鱼圈区", "老边区", "大石桥市", "盖州市"]);
dsy.add("0_7_11", ["兴隆台区", "双台子区", "大洼县",  "盘山县", "盘锦市双台子区"]);
dsy.add("0_7_12", ["太和区", "古塔区", "凌河区", "凌海市", "北宁市", "黑山县",  "义县"]);
dsy.add("0_7_13", ["龙港区", "连山区", "南票区", "兴城市", "绥中县", "建昌县"]);
dsy.add("0_7", ["沈阳市", "朝阳市", "阜新市", "铁岭市", "抚顺市", "本溪市", "辽阳市", "鞍山市", "丹东市", "大连市", "营口市", "盘锦市", "锦州市", "葫芦岛市"]);

dsy.add("0_8_0", ["朝阳区", "南关区", "宽城区", "二道区", "绿园区", "双阳区", "德惠市", "九台市", "榆树市", "农安县"]);
dsy.add("0_8_1", ["洮北区", "大安市", "洮南市", "镇赉县",  "通榆县"]);
dsy.add("0_8_2", ["宁江区", "扶余县", "长岭县",  "乾安县",  "前郭尔罗斯蒙古族自治县"]);
dsy.add("0_8_3", ["船营区", "龙潭区", "昌邑区", "丰满区", "磐石市", "蛟河市", "桦甸市", "舒兰市", "永吉县"]);
dsy.add("0_8_4", ["铁西区", "铁东区", "双辽市", "公主岭市", "梨树县", "伊通满族自治县"]);
dsy.add("0_8_5", ["龙山区", "西安区", "东丰县",  "东辽县"]);
dsy.add("0_8_6", ["东昌区", "二道江区", "梅河口市", "集安市", "通化县",  "辉南县", "柳河县"]);
dsy.add("0_8_7", ["八道江区", "临江市", "江源县",  "抚松县", "靖宇县",  "长白朝鲜族自治县"]);
dsy.add("0_8_8", ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"]);
dsy.add("0_8", ["长春市", "白城市", "松原市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "延边州"]);

dsy.add("0_9_0", ["松北区", "道里区", "南岗区", "道外区", "香坊区", "动力区", "平房区", "呼兰区", "双城市", "尚志市", "五常市", "阿城市", "依兰县", "方正县",  "宾县",  "巴彦县", "木兰县",  "通河县",  "延寿县"]);
dsy.add("0_9_1", ["建华区", "龙沙区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "讷河市", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县",  "克东县", "拜泉县"]);
dsy.add("0_9_2", ["桃山区", "新兴区", "茄子河区", "勃利县"]);
dsy.add("0_9_3", ["爱辉区", "北安市", "五大连池市", "嫩江县", "逊克县", "孙吴县"]);
dsy.add("0_9_4", ["萨尔图区", "龙凤区", "让胡路区", "大同区", "红岗区", "肇州县",  "肇源县", "林甸县",  "杜尔伯特蒙古族自治县"]);
dsy.add("0_9_5", ["兴山区", "向阳区", "工农区", "南山区", "兴安区", "东山区", "萝北县",  "绥滨县"]);
dsy.add("0_9_6", ["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区", "上甘岭区", "铁力市", "嘉荫县"]);
dsy.add("0_9_7", ["前进区", "永红区", "向阳区", "东风区", "郊区", "同江市", "富锦市", "桦南县","桦川县", "汤原县", "抚远县"]);
dsy.add("0_9_8", ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县",  "友谊县",  "宝清县",  "饶河县"]);
dsy.add("0_9_9", ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "虎林市", "密山市", "鸡东县"]);
dsy.add("0_9_10", ["爱民区", "东安区", "阳明区", "西安区", "穆棱市", "绥芬河市", "海林市", "宁安市", "东宁县",  "林口县",]);
dsy.add("0_9_11", ["北林区", "安达市", "肇东市", "海伦市", "望奎县", "兰西县",  "青冈县","庆安县",  "明水县",  "绥棱县"]);
dsy.add("0_9_12", ["呼玛县", "塔河县",  "漠河县"]);
dsy.add("0_9", ["哈尔滨市", "齐齐哈尔市", "七台河市", "黑河市", "大庆市", "鹤岗市", "伊春市", "佳木斯市", "双鸭山市", "鸡西市", "牡丹江市", "绥化市", "大兴安岭地区"]);

dsy.add("0_10_0", ["玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "浦口区", "六合区", "栖霞区", "雨花台区", "江宁区", "溧水县",  "高淳县"]);
dsy.add("0_10_1", ["云龙区", "鼓楼区", "九里区", "贾汪区", "泉山区", "邳州市", "新沂市", "铜山县", "睢宁县", "沛县", "丰县"]);
dsy.add("0_10_2", ["新浦区", "连云区", "海州区", "赣榆县",  "灌云县","东海县", "灌南县"]);
dsy.add("0_10_3", ["宿城区", "宿豫区", "沭阳县", "泗阳县","泗洪县"]);
dsy.add("0_10_4", ["清河区", "清浦区", "楚州区", "淮阴区", "金湖县", "盱眙县", "洪泽县", "涟水县"]);
dsy.add("0_10_5", ["亭湖区", "盐都区", "东台市", "大丰市", "射阳县", "阜宁县", "滨海县","响水县", "建湖县"]);
dsy.add("0_10_6", ["维扬区", "广陵区", "邗江区", "仪征市", "江都市", "高邮市", "宝应县"]);
dsy.add("0_10_7", ["海陵区", "高港区", "靖江市", "泰兴市", "姜堰市", "兴化市"]);
dsy.add("0_10_8", ["崇川区", "港闸区", "海门市", "启东市", "通州市", "如皋市", "如东县","海安县"]);
dsy.add("0_10_9", ["京口区", "润州区", "丹徒区", "扬中市", "丹阳市", "句容市"]);
dsy.add("0_10_10", ["钟楼区", "天宁区", "戚墅堰区", "新北区", "武进区", "金坛市", "溧阳市"]);
dsy.add("0_10_11", ["崇安区", "南长区", "北塘区", "滨湖区", "惠山区", "锡山区", "江阴市", "宜兴市"]);
dsy.add("0_10_12", ["金阊区", "沧浪区", "平江区", "虎丘区", "吴中区", "相城区", "吴江市", "昆山市", "太仓市", "常熟市", "张家港市"]);
dsy.add("0_10", ["南京市", "徐州市", "连云港市", "宿迁市", "淮安市", "盐城市", "扬州市", "泰州市", "南通市", "镇江市", "常州市", "无锡市", "苏州市"]);

dsy.add("0_11_0", ["拱墅区", "上城区", "下城区", "江干区", "西湖区", "滨江区", "余杭区", "萧山区", "临安市", "富阳市", "建德市", "桐庐县", "淳安县"]);
dsy.add("0_11_1", ["吴兴区", "南浔区", "长兴县",  "德清县","安吉县"]);
dsy.add("0_11_2", ["南湖区", "秀洲区", "平湖市", "海宁市", "桐乡市", "嘉善县", "海盐县"]);
dsy.add("0_11_3", ["定海区", "普陀区", "岱山县", "嵊泗县"]);
dsy.add("0_11_4", ["海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "慈溪市", "余姚市", "奉化市", "宁海县", "象山县"]);
dsy.add("0_11_5", ["越城区", "诸暨市", "上虞市", "嵊州市", "绍兴县", "新昌县"]);
dsy.add("0_11_6", ["柯城区", "衢江区", "江山市", "常山县","开化县", "龙游县"]);
dsy.add("0_11_7", ["婺城区", "金东区", "兰溪市", "永康市", "义乌市", "东阳市", "武义县", "浦江县", "磐安县"]);
dsy.add("0_11_8", ["椒江区", "黄岩区", "路桥区", "临海市", "温岭市", "三门县",  "天台县", "仙居县", "玉环县"]);
dsy.add("0_11_9", ["鹿城区", "龙湾区", "瓯海区", "瑞安市", "乐清市", "永嘉县", "文成县", "平阳县", "泰顺县", "洞头县", "苍南县"]);
dsy.add("0_11_10", ["莲都区", "龙泉市", "缙云县", "青田县", "云和县",  "遂昌县", "松阳县", "庆元县",  "景宁畲族自治县"]);
dsy.add("0_11", ["杭州市", "湖州市", "嘉兴市", "舟山市", "宁波市", "绍兴市", "衢州市", "金华市", "台州市", "温州市", "丽水市"]);

dsy.add("0_12_0", ["庐阳区", "瑶海区", "蜀山区", "包河区", "长丰县", "肥东县","肥西县"]);
dsy.add("0_12_1", ["埇桥区", "砀山县", "萧县", "灵璧县", "泗县"]);
dsy.add("0_12_2", ["相山区", "杜集区", "烈山区", "濉溪县"]);
dsy.add("0_12_3", ["谯城区", "涡阳县","蒙城县", "利辛县"]);
dsy.add("0_12_4", ["颍州区", "颍东区", "颍泉区", "界首市", "临泉县",  "太和县", "阜南县", "颍上县"]);
dsy.add("0_12_5", ["蚌山区", "龙子湖区", "禹会区", "淮上区", "怀远县",  "五河县",  "固镇县"]);
dsy.add("0_12_6", ["田家庵区", "大通区", "谢家集区", "八公山区", "潘集区", "凤台县"]);
dsy.add("0_12_7", ["琅区", "南谯区", "明光市", "天长市", "来安县", "全椒县", "定远县","凤阳县"]);
dsy.add("0_12_8", ["雨山区", "花山区", "金家庄区", "当涂县"]);
dsy.add("0_12_9", ["镜湖区", "弋江区", "三山区", "鸠江区", "芜湖县",  "繁昌县","南陵县"]);
dsy.add("0_12_10", ["铜官山区", "狮子山区", "郊区", "铜陵县"]);
dsy.add("0_12_11", ["迎江区", "大观区", "宜秀区", "桐城市", "怀宁县","枞阳县", "潜山县",  "太湖县",  "宿松县", "望江县", "岳西县"]);
dsy.add("0_12_12", ["屯溪区", "黄山区", "徽州区", "歙县","休宁县", "黟县",  "祁门县"]);
dsy.add("0_12_13", ["金安区", "裕安区", "寿县","霍邱县","舒城县","金寨县",  "霍山县"]);
dsy.add("0_12_14", ["居巢区", "庐江县",  "无为县","含山县","和县"]);
dsy.add("0_12_15", ["贵池区", "东至县",  "石台县", "青阳县"]);
dsy.add("0_12_16", ["宣州区", "宁国市", "郎溪县", "广德县", "泾县","旌德县","绩溪县"]);
dsy.add("0_12", ["合肥市", "宿州市", "淮北市", "亳州市", "阜阳市", "蚌埠市", "淮南市", "滁州市", "马鞍山市", "芜湖市", "铜陵市", "安庆市", "黄山市", "六安市", "巢湖市", "池州市", "宣城市"]);
dsy.add("0_13_0", ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "福清市", "长乐市", "闽侯县", "连江县",  "罗源县", "闽清县", "永泰县", "平潭县"]);
dsy.add("0_13_1", ["延平区", "邵武市", "武夷山市", "建瓯市", "建阳市", "顺昌县", "光泽县","松溪县", "政和县"]);
dsy.add("0_13_2", ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"]);
dsy.add("0_13_3", ["梅列区", "三元区", "永安市", "明溪县","清流县", "宁化县", "大田县", "尤溪县",  "沙县", "将乐县", "泰宁县",  "建宁县"]);
dsy.add("0_13_4", ["鲤城区", "丰泽区", "洛江区", "泉港区", "石狮市", "晋江市", "南安市", "惠安县", "安溪县", "永春县","德化县", "金门县"]);
dsy.add("0_13_5", ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"]);
dsy.add("0_13_6", ["芗城区", "龙文区", "龙海市", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县",  "南靖县", "平和县",  "华安县"]);
dsy.add("0_13_7", ["新罗区", "漳平市", "长汀县", "永定县", "上杭县", "武平县", "连城县"]);
dsy.add("0_13_8", ["蕉城区", "福安市", "福鼎市", "寿宁县","霞浦县", "柘荣县", "屏南县",  "古田县", "周宁县"]);
dsy.add("0_13", ["福州市", "南平市", "莆田市", "三明市", "泉州市", "厦门市", "漳州市", "龙岩市", "宁德市"]);

dsy.add("0_14_0", ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "南昌县", "新建县", "安义县", "进贤县"]);
dsy.add("0_14_1", ["浔阳区", "庐山区", "瑞昌市", "九江县", "武宁县", "修水县", "永修县",  "德安县", "星子县", "都昌县", "湖口县", "彭泽县"]);
dsy.add("0_14_2", ["珠山区", "昌江区", "乐平市", "浮梁县"]);
dsy.add("0_14_3", ["月湖区", "贵溪市", "余江县"]);
dsy.add("0_14_4", ["渝水区", "分宜县"]);
dsy.add("0_14_5", ["安源区", "湘东区", "莲花县","上栗县",  "芦溪县"]);
dsy.add("0_14_6", ["章贡区", "瑞金市", "南康市", "赣县",  "信丰县",  "大余县","上犹县", "崇义县",  "安远县", "龙南县", "定南县",  "全南县",  "宁都县", "于都县",  "兴国县", "会昌县", "寻乌县", "石城县"]);
dsy.add("0_14_7", ["信州区", "德兴市", "上饶县","广丰县", "玉山县", "铅山县", "横峰县", "弋阳县","余干县", "鄱阳县",  "万年县",  "婺源县"]);
dsy.add("0_14_8", ["临川区", "南城县",  "黎川县", "南丰县","崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "东乡县", "广昌县"]);
dsy.add("0_14_9", ["袁州区", "丰城市", "樟树市", "高安市", "奉新县",  "万载县", "上高县", "宜丰县",  "靖安县", "铜鼓县"]);
dsy.add("0_14_10", ["吉州区", "青原区", "井冈山市", "吉安县", "吉水县",  "峡江县", "新干县",  "永丰县", "泰和县",  "遂川县", "万安县","安福县", "永新县"]);
dsy.add("0_14", ["南昌市", "九江市", "景德镇市", "鹰潭市", "新余市", "萍乡市", "赣州市", "上饶市", "抚州市", "宜春市", "吉安市"]);

dsy.add("0_15_0", ["市中区", "历下区", "槐荫区", "天桥区", "历城区", "长清区", "章丘市", "平阴县",  "济阳县", "商河县"]);
dsy.add("0_15_1", ["市南区", "市北区", "四方区", "黄岛区", "崂山区", "城阳区", "李沧区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市"]);
dsy.add("0_15_2", ["东昌府区", "临清市", "阳谷县", "莘县", "茌平县", "东阿县", "冠县",  "高唐县"]);
dsy.add("0_15_3", ["德城区", "乐陵市", "禹城市", "陵县", "平原县", "夏津县",  "武城县","齐河县", "临邑县", "宁津县", "庆云县"]);
dsy.add("0_15_4", ["东营区", "河口区", "垦利县", "利津县", "广饶县"]);
dsy.add("0_15_5", ["张店区", "淄川区", "博山区", "临淄区", "周村区", "桓台县", "高青县","沂源县"]);
dsy.add("0_15_6", ["潍城区", "寒亭区", "坊子区", "奎文区", "安丘市", "昌邑市", "高密市", "青州市", "诸城市", "寿光市", "临朐县", "昌乐县"]);
dsy.add("0_15_7", ["莱山区", "芝罘区", "福山区", "牟平区", "栖霞市", "海阳市", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "长岛县"]);
dsy.add("0_15_8", ["环翠区", "荣成市", "乳山市", "文登市"]);

dsy.add("0_15_9", ["东港区", "岚山区", "五莲县", "莒县"]);
dsy.add("0_15_10", ["兰山区", "罗庄区", "河东区", "郯城县", "苍山县", "莒南县", "沂水县","蒙阴县", "平邑县", "费县",  "沂南县","临沭县"]);
dsy.add("0_15_11", ["薛城区", "市中区", "峄城区", "台儿庄区", "山亭区", "滕州市"]);
dsy.add("0_15_12", ["市中区", "任城区", "曲阜市", "兖州市", "邹城市", "微山县", "鱼台县",  "金乡县",  "嘉祥县", "汶上县",  "泗水县", "梁山县"]);
dsy.add("0_15_13", ["泰山区", "岱岳区", "新泰市", "肥城市", "宁阳县",  "东平县"]);
dsy.add("0_15_14", ["莱城区", "钢城区"]);
dsy.add("0_15_15", ["滨城区", "惠民县","阳信县", "无棣县",  "沾化县", "博兴县", "邹平县"]);
dsy.add("0_15_16", ["牡丹区", "曹县", "定陶县","成武县",  "单县","巨野县", "郓城县",  "鄄城县", "东明县"]);
dsy.add("0_15", ["济南市", "青岛市", "聊城市", "德州市", "东营市", "淄博市", "潍坊市", "烟台市", "威海市", "日照市", "临沂市", "枣庄市", "济宁市", "泰安市", "莱芜市", "滨州市", "菏泽市"]);
dsy.add("0_16_0", ["中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "新郑市", "登封市", "新密市", "巩义市", "荥阳市", "中牟县"]);
dsy.add("0_16_1", ["鼓楼区", "龙亭区", "顺河回族区", "禹王台区", "金明区", "杞县", "通许县","尉氏县","开封县",  "兰考县"]);
dsy.add("0_16_2", ["湖滨区", "义马市", "灵宝市", "渑池县", "陕县", "卢氏县"]);
dsy.add("0_16_3", ["西工区", "老城区", "瀍河回族区", "涧西区", "吉利区", "洛龙区", "偃师市", "孟津县",  "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县"]);
dsy.add("0_16_4", ["解放区", "山阳区", "中站区", "马村区", "孟州市", "沁阳市", "修武县", "博爱县",  "武陟县", "温县"]);
dsy.add("0_16_5", ["卫滨区", "红旗区", "凤泉区", "牧野区", "卫辉市", "辉县市", "新乡县", "新乡市红旗区", "获嘉县", "原阳县", "延津县", "封丘县", "长垣县"]);
dsy.add("0_16_6", ["淇滨区", "山城区", "鹤山区", "浚县", "淇县"]);
dsy.add("0_16_7", ["北关区", "文峰区", "殷都区", "龙安区", "林州市", "安阳县", "安阳市北关区", "汤阴县", "滑县", "内黄县"]);
dsy.add("0_16_8", ["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县"]);
dsy.add("0_16_9", ["梁园区", "睢阳区", "永城市", "虞城县", "民权县", "宁陵县", "睢县", "夏邑县", "柘城县"]);
dsy.add("0_16_10", ["魏都区", "禹州市", "长葛市", "许昌县", "许昌市魏都区", "鄢陵县", "襄城县"]);
dsy.add("0_16_11", ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县"]);
dsy.add("0_16_12", ["新华区", "卫东区", "湛河区", "石龙区", "舞钢市", "汝州市", "宝丰县", "叶县", "鲁山县", "郏县"]);
dsy.add("0_16_13", ["卧龙区", "宛城区", "邓州市", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县",  "唐河县", "新野县", "桐柏县"]);
dsy.add("0_16_14", ["河区", "平桥区", "息县", "淮滨县", "潢川县", "光山县", "固始县", "商城县", "罗山县", "新县"]);
dsy.add("0_16_15", ["川汇区", "项城市", "扶沟县", "西华县", "商水县", "太康县", "鹿邑县", "郸城县", "淮阳县", "沈丘县"]);
dsy.add("0_16_16", ["驿城区", "确山县", "泌阳县", "遂平县","西平县", "上蔡县",  "汝南县", "平舆县", "新蔡县", "正阳县"]);
dsy.add("0_16", ["郑州市", "开封市", "三门峡市", "洛阳市", "焦作市", "新乡市", "鹤壁市", "安阳市", "濮阳市", "商丘市", "许昌市", "漯河市", "平顶山市", "南阳市", "信阳市", "周口市", "驻马店市"]);

dsy.add("0_17_0", ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"]);
dsy.add("0_17_1", ["张湾区", "茅箭区", "丹江口市", "郧县", "竹山县", "房县", "郧西县", "竹溪县"]);
dsy.add("0_17_2", ["襄城区", "樊城区", "襄阳区", "老河口市", "枣阳市", "宜城市", "南漳县", "谷城县", "保康县"]);
dsy.add("0_17_3", ["东宝区", "掇刀区", "钟祥市", "沙洋县", "京山县"]);
dsy.add("0_17_4", ["孝南区", "应城市", "安陆市", "汉川市", "孝昌县", "大悟县", "云梦县"]);
dsy.add("0_17_5", ["黄州区", "麻城市", "武穴市", "红安县", "罗田县", "英山县",  "浠水县",  "蕲春县",  "黄梅县", "团风县"]);
dsy.add("0_17_6", ["鄂城区", "梁子湖区", "华容区"]);
dsy.add("0_17_7", ["黄石港区", "西塞山区", "下陆区", "铁山区", "大冶市", "阳新县"]);
dsy.add("0_17_8", ["咸安区", "赤壁市", "嘉鱼县",  "通城县", "崇阳县","通山县"]);
dsy.add("0_17_9", ["沙市区", "荆州区", "石首市", "洪湖市", "松滋市", "江陵县", "公安县",  "监利县"]);
dsy.add("0_17_10", ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "枝江市", "宜都市", "当阳市", "远安县", "兴山县", "秭归县","长阳土家族自治县", "五峰土家族自治县"]);
dsy.add("0_17_11", ["曾都区", "广水市"]);
dsy.add("0_17_12", ["仙桃市", "天门市", "潜江市", "神农架林区"]);
dsy.add("0_17_13", ["恩施市", "利川市", "建始县", "巴东县",  "宣恩县", "咸丰县", "来凤县","鹤峰县"]);
dsy.add("0_17", ["武汉市", "十堰市", "襄樊市", "荆门市", "孝感市", "黄冈市", "鄂州市", "黄石市", "咸宁市", "荆州市", "宜昌市", "随州市", "省直辖县级行政单位", "恩施州"]);

dsy.add("0_18_0", ["长沙市", "岳麓区", "芙蓉区", "天心区", "开福区", "雨花区", "浏阳市", "长沙县",  "望城县", "宁乡县"]);
dsy.add("0_18_1", ["永定区", "武陵源区", "慈利县","桑植县"]);
dsy.add("0_18_2", ["武陵区", "鼎城区", "津市市", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县"]);
dsy.add("0_18_3", ["赫山区", "资阳区", "沅江市", "南县",  "桃江县",  "安化县"]);
dsy.add("0_18_4", ["岳阳楼区", "君山区", "云溪区", "汨罗市", "临湘市", "岳阳县", "华容县", "湘阴县",  "平江县"]);
dsy.add("0_18_5", ["天元区", "荷塘区", "芦淞区", "石峰区", "醴陵市", "株洲县",  "攸县", "茶陵县", "炎陵县"]);
dsy.add("0_18_6", ["岳塘区", "雨湖区", "湘乡市", "韶山市", "湘潭县"]);
dsy.add("0_18_7", ["雁峰区", "珠晖区", "石鼓区", "蒸湘区", "南岳区", "常宁市", "耒阳市", "衡阳县","衡南县", "衡山县", "衡东县"]);
dsy.add("0_18_8", ["北湖区", "苏仙区", "资兴市", "桂阳县", "永兴县", "宜章县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县"]);
dsy.add("0_18_9", ["冷水滩区", "零陵区", "东安县","道县","宁远县","江永县", "蓝山县", "新田县",  "双牌县", "祁阳县",  "江华瑶族自治县"]);
dsy.add("0_18_10", ["双清区", "大祥区", "北塔区", "武冈市", "邵东县", "邵阳县","新邵县", "隆回县", "洞口县","绥宁县", "新宁县",  "城步苗族自治县"]);
dsy.add("0_18_11", ["鹤城区", "洪江市", "沅陵县", "辰溪县", "溆浦县","中方县", "会同县", "麻阳苗族自治县","新晃侗族自治县","芷江侗族自治县", "靖州苗族侗族自治县", "通道侗族自治县"]);
dsy.add("0_18_12", ["娄星区", "冷水江市", "涟源市", "双峰县", "新化县"]);
dsy.add("0_18_13", ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县","古丈县","永顺县",  "龙山县"]);
dsy.add("0_18", ["长沙市", "张家界市", "常德市", "益阳市", "岳阳市", "株洲市", "湘潭市", "衡阳市", "郴州市", "永州市", "邵阳市", "怀化市", "娄底市", "湘西州"]);

dsy.add("0_19_0", ["越秀区", "荔湾区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "萝岗区", "增城市", "从化市"]);
dsy.add("0_19_1", ["福田区", "罗湖区", "南山区", "宝安区", "龙岗区", "盐田区"]);
dsy.add("0_19_2", ["清城区", "英德市", "连州市", "佛冈县", "阳山县",  "清新县","连山壮族瑶族自治县", "连南瑶族自治县"]);
dsy.add("0_19_3", ["浈江区", "武江区", "曲江区", "乐昌市", "南雄市", "始兴县", "仁化县", "翁源县",  "新丰县", "乳源瑶族自治县"]);
dsy.add("0_19_4", ["源城区", "紫金县","龙川县",  "连平县","和平县","东源县"]);
dsy.add("0_19_5", ["梅江区", "兴宁市", "梅县",  "大埔县",  "丰顺县", "五华县", "平远县","蕉岭县"]);
dsy.add("0_19_6", ["湘桥区", "潮安县",  "饶平县"]);
dsy.add("0_19_7", ["金平区", "濠江区", "龙湖区", "潮阳区", "潮南区", "澄海区", "南澳县"]);
dsy.add("0_19_8", ["榕城区", "普宁市", "揭东县", "揭西县", "惠来县"]);
dsy.add("0_19_9", ["城区", "陆丰市", "海丰县","陆河县"]);
dsy.add("0_19_10", ["惠城区", "惠阳区", "博罗县",  "惠东县", "龙门县"]);
dsy.add("0_19_11", ["莞城区", "南城区", "东城区",  "万江区"]);
dsy.add("0_19_12", ["香洲区", "斗门区", "金湾区"]);
dsy.add("0_19_13", ["东区", "南区", "石岐区", "西区", "五桂山区"]);
dsy.add("0_19_14", ["江海区", "蓬江区", "新会区", "恩平市", "台山市", "开平市", "鹤山市"]);
dsy.add("0_19_15", ["禅城区", "南海区", "顺德区", "三水区", "高明区"]);
dsy.add("0_19_16", ["端州区", "鼎湖区", "高要市", "四会市", "广宁县",  "怀集县","封开县",  "德庆县"]);
dsy.add("0_19_17", ["云城区", "罗定市", "云安县", "新兴县","郁南县"]);
dsy.add("0_19_18", ["江城区", "阳春市", "阳西县",  "阳东县"]);
dsy.add("0_19_19", ["茂南区", "茂港区", "化州市", "信宜市", "高州市", "电白县"]);
dsy.add("0_19_20", ["赤坎区", "霞山区", "坡头区", "麻章区", "吴川市", "廉江市", "雷州市", "遂溪县", "徐闻县", "撤销广州市东山区", "芳村区", "设立广州市南沙区", "萝岗区"]);
dsy.add("0_19", ["广州市", "深圳市", "清远市", "韶关市", "河源市", "梅州市", "潮州市", "汕头市", "揭阳市", "汕尾市", "惠州市", "东莞市", "珠海市", "中山市", "江门市", "佛山市", "肇庆市", "云浮市", "阳江市", "茂名市", "湛江市"]);

dsy.add("0_20_0", ["青秀区", "兴宁区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣县", "横县", "宾阳县", "上林县", "隆安县", "马山县"]);
dsy.add("0_20_1", ["象山区", "叠彩区", "秀峰区", "七星区", "雁山区", "阳朔县",  "临桂县","灵川县",  "全州县","兴安县", "永福县", "灌阳县", "资源县",  "平乐县", "荔浦县","龙胜各族自治县","恭城瑶族自治县"]);
dsy.add("0_20_2", ["城中区", "鱼峰区", "柳南区", "柳北区", "柳江县",  "柳城县", "鹿寨县", "融安县", "三江侗族自治县", "融水苗族自治县"]);
dsy.add("0_20_3", ["万秀区", "蝶山区", "长洲区", "岑溪市", "苍梧县",  "藤县","蒙山县"]);
dsy.add("0_20_4", ["港北区", "港南区", "覃塘区", "桂平市", "平南县"]);
dsy.add("0_20_5", ["玉州区", "北流市", "兴业县", "容县",  "陆川县",  "博白县"]);
dsy.add("0_20_6", ["钦南区", "钦北区", "灵山县", "浦北县"]);
dsy.add("0_20_7", ["海城区", "银海区", "铁山港区", "合浦县"]);
dsy.add("0_20_8", ["港口区", "防城区", "东兴市", "上思县"]);
dsy.add("0_20_9", ["江州区", "凭祥市", "扶绥县", "大新县","天等县","宁明县", "龙州县"]);
dsy.add("0_20_10", ["右江区", "田阳县",  "田东县", "平果县", "德保县", "靖西县",  "那坡县","凌云县","乐业县", "西林县", "田林县","隆林各族自治县"]);
dsy.add("0_20_11", ["金城江区", "宜州市", "南丹县", "天峨县","凤山县","东兰县", "巴马瑶族自治县","都安瑶族自治县", "大化瑶族自治县", "罗城仫佬族自治县", "环江毛南族自治县"]);
dsy.add("0_20_12", ["兴宾区", "合山市", "象州县","武宣县", "忻城县", "金秀瑶族自治县"]);
dsy.add("0_20_13", ["八步区", "昭平县", "钟山县",  "富川瑶族自治县"]);
dsy.add("0_20", ["南宁市", "桂林市", "柳州市", "梧州市", "贵港市", "玉林市", "钦州市", "北海市", "防城港市", "崇左市", "百色市", "河池市", "来宾市", "贺州市"]);
dsy.add("0_21_0", ["龙华区", "秀英区", "琼山区", "美兰区"]);
dsy.add("0_21_1", ["吉阳区", "崖州区", "天涯区", "海棠区"]);
dsy.add("0_21_2", ["文昌市", "琼海市", "万宁市", "五指山市", "东方市", "儋州市", "临高县","澄迈县", "定安县",  "屯昌县", "昌江黎族自治县", "白沙黎族自治县", "琼中黎族苗族自治县","陵水黎族自治县", "保亭黎族苗族自治县",  "乐东黎族自治县"]);
dsy.add("0_21", ["海口市", "三亚市", "省直辖行政单位"]);

dsy.add("0_22_0", ["青羊区", "锦江区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "都江堰市", "彭州市", "邛崃市", "崇州市", "金堂县", "双流县", "郫县", "大邑县",  "蒲江县",  "新津县"]);
dsy.add("0_22_1", ["市中区", "元坝区", "朝天区", "旺苍县", "青川县","剑阁县", "苍溪县"]);
dsy.add("0_22_2", ["涪城区", "游仙区", "江油市", "三台县", "盐亭县", "安县",  "梓潼县", "北川羌族自治县", "平武县"]);
dsy.add("0_22_3", ["旌阳区", "什邡市", "广汉市", "绵竹市", "罗江县", "中江县"]);
dsy.add("0_22_4", ["顺庆区", "高坪区", "嘉陵区", "阆中市", "南部县", "营山县","蓬安县", "仪陇县","西充县"]);
dsy.add("0_22_5", ["广安区", "华蓥市", "岳池县",  "武胜县", "邻水县"]);
dsy.add("0_22_6", ["船山区", "安居区", "蓬溪县", "射洪县",  "大英县"]);
dsy.add("0_22_7", ["市中区", "东兴区", "威远县",  "资中县", "隆昌县"]);
dsy.add("0_22_8", ["市中区", "沙湾区", "五通桥区", "金口河区", "峨眉山市", "犍为县", "井研县",  "夹江县",  "沐川县", "峨边彝族自治县", "马边彝族自治县"]);
dsy.add("0_22_9", ["自流井区", "大安区", "贡井区", "沿滩区", "荣县","富顺县"]);
dsy.add("0_22_10", ["江阳区", "纳溪区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县"]);
dsy.add("0_22_11", ["翠屏区", "宜宾县","南溪县", "江安县", "长宁县", "高县", "筠连县","珙县", "兴文县", "屏山县"]);
dsy.add("0_22_12", ["东区", "西区", "仁和区", "米易县",  "盐边县"]);
dsy.add("0_22_13", ["巴州区", "通江县", "南江县", "平昌县"]);
dsy.add("0_22_14", ["通川区", "万源市", "达县","宣汉县",  "开江县","大竹县", "渠县"]);
dsy.add("0_22_15", ["雁江区", "简阳市", "乐至县",  "安岳县"]);
dsy.add("0_22_16", ["东坡区", "仁寿县",  "彭山县",  "洪雅县",  "丹棱县",  "青神县"]);
dsy.add("0_22_17", ["雨城区", "名山县",  "荥经县",  "汉源县", "石棉县","天全县","芦山县",  "宝兴县"]);
dsy.add("0_22_18", ["马尔康县","汶川县", "理县", "茂县", "松潘县", "九寨沟县","金川县", "小金县",  "黑水县", "壤塘县","阿坝县", "若尔盖县", "红原县"]);
dsy.add("0_22_19", ["康定县", "泸定县", "丹巴县","九龙县",  "雅江县",  "道孚县",  "炉霍县",  "甘孜县",  "新龙县",  "德格县", "白玉县",  "石渠县", "色达县", "理塘县", "巴塘县",  "乡城县", "稻城县", "得荣县"]);
dsy.add("0_22_20", ["西昌市", "盐源县", "德昌县",  "会理县", "会东县","宁南县", "普格县","布拖县", "金阳县", "昭觉县", "喜德县","冕宁县", "越西县", "甘洛县",  "美姑县", "雷波县", "木里藏族自治县"]);
dsy.add("0_22", ["成都市", "广元市", "绵阳市", "德阳市", "南充市", "广安市", "遂宁市", "内江市", "乐山市", "自贡市", "泸州市", "宜宾市", "攀枝花市", "巴中市", "达州市", "资阳市", "眉山市", "雅安市", "阿坝州", "甘孜州", "凉山州"]);

dsy.add("0_23_0", ["乌当区", "南明区", "云岩区", "花溪区", "白云区", "小河区", "清镇市", "开阳县", "修文县", "息烽县"]);
dsy.add("0_23_1", ["钟山区", "盘县",  "六枝特区",  "水城县"]);
dsy.add("0_23_2", ["红花岗区", "汇川区", "赤水市", "仁怀市", "遵义县", "桐梓县",  "绥阳县",  "正安县", "凤冈县", "湄潭县", "余庆县", "习水县","道真仡佬族苗族自治县", "务川仡佬族苗族自治县"]);
dsy.add("0_23_3", ["西秀区", "平坝县", "普定县", "关岭布依族苗族自治县", "镇宁布依族苗族自治县", "紫云苗族布依族自治县"]);
dsy.add("0_23_4", ["毕节市", "大方县", "黔西县", "金沙县", "织金县", "纳雍县",  "赫章县", "威宁彝族回族苗族自治县"]);
dsy.add("0_23_5", ["铜仁市", "江口县",  "石阡县", "思南县",  "德江县","玉屏侗族自治县","印江土家族苗族自治县", "沿河土家族自治县","松桃苗族自治县",  "万山特区"]);
dsy.add("0_23_6", ["凯里市", "黄平县",  "施秉县", "三穗县","镇远县", "岑巩县", "天柱县", "锦屏县","剑河县",  "台江县","黎平县","榕江县",  "从江县","雷山县",  "麻江县","丹寨县"]);
dsy.add("0_23_7", ["都匀市", "福泉市", "荔波县","贵定县", "瓮安县",  "独山县", "平塘县",  "罗甸县","长顺县", "龙里县","惠水县", "三都水族自治县"]);
dsy.add("0_23_8", ["兴义市", "兴仁县", "普安县",  "晴隆县", "贞丰县",  "望谟县", "册亨县", "安龙县"]);
dsy.add("0_23", ["贵阳市", "六盘水市", "遵义市", "安顺市", "毕节地区", "铜仁地区", "黔东南州", "黔南州", "黔西南州"]);

dsy.add("0_24_0", ["盘龙区", "五华区", "官渡区", "西山区", "东川区", "安宁市", "呈贡县",  "晋宁县","富民县",  "宜良县",  "嵩明县","石林彝族自治县","禄劝彝族苗族自治县",  "寻甸回族彝族自治县"]);
dsy.add("0_24_1", ["麒麟区", "宣威市", "马龙县",  "沾益县", "富源县", "罗平县", "师宗县", "陆良县", "会泽县"]);
dsy.add("0_24_2", ["红塔区", "江川县", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县",  "新平彝族傣族自治县","元江哈尼族彝族傣族自治县"]);
dsy.add("0_24_3", ["隆阳区", "施甸县", "腾冲县", "龙陵县", "昌宁县"]);
dsy.add("0_24_4", ["昭阳区", "鲁甸县",  "巧家县",  "盐津县", "大关县", "永善县",  "绥江县",  "镇雄县", "彝良县", "威信县", "水富县"]);
dsy.add("0_24_5", ["古城区", "永胜县",  "华坪县",  "玉龙纳西族自治县", "宁蒗彝族自治县"]);
dsy.add("0_24_6", ["翠云区", "普洱哈尼族彝族自治县", "墨江哈尼族自治县",  "景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县",  "江城哈尼族彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "西盟佤族自治县"]);
dsy.add("0_24_7", ["临翔区", "凤庆县","云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县",  "沧源佤族自治县"]);
dsy.add("0_24_8", ["潞西市", "瑞丽市", "梁河县",  "盈江县", "陇川县"]);
dsy.add("0_24_9", ["泸水县",  "福贡县", "贡山独龙族怒族自治县",  "兰坪白族普米族自治县"]);
dsy.add("0_24_10", ["香格里拉县","德钦县", "维西傈僳族自治县"]);
dsy.add("0_24_11", ["大理市", "祥云县", "宾川县","弥渡县",  "永平县", "云龙县",  "洱源县",  "剑川县", "鹤庆县", "漾濞彝族自治县", "南涧彝族自治县",  "巍山彝族回族自治县"]);
dsy.add("0_24_12", ["楚雄市", "双柏县", "牟定县",  "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县",  "禄丰县"]);
dsy.add("0_24_13", ["蒙自县", "个旧市", "开远市", "绿春县", "建水县",  "石屏县", "弥勒县", "泸西县","元阳县", "红河县","金平苗族瑶族傣族自治县",  "河口瑶族自治县","屏边苗族自治县"]);
dsy.add("0_24_14", ["文山县",  "砚山县", "西畴县",  "麻栗坡县","马关县","丘北县", "广南县", "富宁县"]);
dsy.add("0_24_15", ["景洪市", "勐海县","勐腊县"]);
dsy.add("0_24", ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市", "临沧市", "德宏州", "怒江州", "迪庆州", "大理州", "楚雄州", "红河州", "文山州", "西双版纳州"]);

dsy.add("0_25_0", ["城关区", "林周县", "当雄县", "尼木县",  "曲水县",  "堆龙德庆县",  "达孜县",  "墨竹工卡县"]);
dsy.add("0_25_1", ["那曲县","嘉黎县","比如县",  "聂荣县",  "安多县", "申扎县","索县",  "班戈县", "巴青县", "尼玛县"]);
dsy.add("0_25_2", ["昌都县", "江达县",  "贡觉县",  "类乌齐县","丁青县","察雅县", "八宿县", "左贡县", "芒康县",  "洛隆县","边坝县"]);
dsy.add("0_25_3", ["林芝县","工布江达县",  "米林县", "墨脱县","波密县",  "察隅县",  "朗县"]);
dsy.add("0_25_4", ["乃东县", "扎囊县", "贡嘎县","桑日县",  "琼结县", "曲松县",  "措美县", "洛扎县","加查县", "隆子县",  "错那县","浪卡子县"]);
dsy.add("0_25_5", ["日喀则市", "南木林县",  "江孜县", "定日县","萨迦县","拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县","仲巴县", "拉让乡", "亚东县","吉隆县","聂拉木县",  "萨嘎县", "岗巴县"]);
dsy.add("0_25_6", ["噶尔县",  "普兰县", "札达县", "日土县","革吉县", "改则县", "措勤县"]);
dsy.add("0_25", ["拉萨市", "那曲地区", "昌都地区", "林芝地区", "山南地区", "日喀则地区", "阿里地区"]);

dsy.add("0_26_0", ["莲湖区", "新城区", "碑林区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县","周至县", "户县",  "高陵县"]);
dsy.add("0_26_1", ["宝塔区", "延长县", "延川县","子长县","安塞县", "志丹县","吴起县", "甘泉县", "富县", "洛川县","宜川县", "黄龙县","黄陵县"]);
dsy.add("0_26_2", ["耀州区", "王益区", "印台区", "宜君县"]);
dsy.add("0_26_3", ["临渭区", "华阴市", "韩城市", "华县",  "潼关县", "大荔县", "蒲城县", "澄城县", "白水县", "合阳县", "富平县"]);
dsy.add("0_26_4", ["秦都区", "杨陵区", "渭城区", "兴平市", "三原县", "泾阳县", "乾县", "礼泉县", "永寿县",  "彬县", "长武县",  "旬邑县", "淳化县", "武功县"]);
dsy.add("0_26_5", ["渭滨区", "金台区", "陈仓区", "凤翔县", "岐山县","扶风县", "眉县", "陇县", "千阳县", "麟游县",  "凤县",  "太白县"]);
dsy.add("0_26_6", ["汉台区", "南郑县", "城固县",  "洋县", "西乡县", "勉县", "宁强县",  "略阳县", "镇巴县", "留坝县", "佛坪县"]);
dsy.add("0_26_7", ["榆阳区", "神木县", "府谷县",  "横山县", "靖边县", "定边县",  "绥德县","米脂县",  "佳县", "吴堡县", "清涧县",  "子洲县"]);
dsy.add("0_26_8", ["汉滨区", "汉阴县", "石泉县", "宁陕县", "紫阳县", "岚皋县", "平利县", "镇坪县", "旬阳县", "白河县"]);
dsy.add("0_26_9", ["商州区", "洛南县", "丹凤县",  "商南县", "山阳县", "镇安县","柞水县"]);
dsy.add("0_26", ["西安市", "延安市", "铜川市", "渭南市", "咸阳市", "宝鸡市", "汉中市", "榆林市", "安康市", "商洛市"]);

dsy.add("0_27_0", ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "皋兰县","榆中县"]);
dsy.add("0_27_1", [ "峪泉镇", "文殊镇", "新城镇"]);
dsy.add("0_27_2", ["白银区", "平川区", "靖远县", "会宁县", "景泰县"]);
dsy.add("0_27_3", ["秦州区", "麦积区", "清水县",  "秦安县", "甘谷县", "武山县", "张家川回族自治县"]);
dsy.add("0_27_4", ["凉州区", "民勤县", "古浪县", "天祝藏族自治县"]);
dsy.add("0_27_5", ["肃州区", "玉门市", "敦煌市", "金塔县", "安西县", "肃北蒙古族自治县",  "阿克塞哈萨克族自治县"]);
dsy.add("0_27_6", ["甘州区", "民乐县", "临泽县", "高台县", "山丹县","肃南裕固族自治县"]);
dsy.add("0_27_7", ["西峰区", "庆城县",  "环县",  "华池县","合水县", "正宁县",  "宁县",  "镇原县"]);
dsy.add("0_27_8", ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县"]);
dsy.add("0_27_9", ["安定区", "通渭县", "临洮县","漳县", "岷县", "渭源县", "陇西县"]);
dsy.add("0_27_10", ["武都区", "成县", "宕昌县", "康县", "文县", "西和县", "礼县", "两当县", "徽县"]);
dsy.add("0_27_11", ["临夏市", "临夏县","康乐县", "永靖县",  "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县"]);
dsy.add("0_27_12", ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县",  "玛曲县",  "碌曲县", "夏河县"]);
dsy.add("0_27_13", [ "金川区", "永昌县"]);
dsy.add("0_27", ["兰州市", "嘉峪关市", "白银市", "天水市", "武威市", "酒泉市", "张掖市", "庆阳市", "平凉市", "定西市", "陇南市", "临夏州", "甘南州","金昌市"]);

dsy.add("0_28_0", ["城中区", "城东区", "城西区", "城北区", "大通回族土族自治县", "湟源县", "湟中县"]);
dsy.add("0_28_1", ["遨游支付县", "乐都县", "民和回族土族自治县",  "互助土族自治县", "化隆回族自治县",  "循化撒拉族自治县"]);
dsy.add("0_28_2", ["海晏县", "祁连县",  "刚察县",  "门源回族自治县"]);
dsy.add("0_28_3", ["共和县",  "同德县", "贵德县", "兴海县", "贵南县"]);
dsy.add("0_28_4", ["同仁县","尖扎县", "泽库县", "河南蒙古族自治县"]);
dsy.add("0_28_5", ["玛沁县", "班玛县", "甘德县", "达日县","久治县",  "玛多县", "黄河乡"]);
dsy.add("0_28_6", ["玉树县","杂多县",  "称多县","治多县", "囊谦县", "曲麻莱县"]);
dsy.add("0_28_7", ["德令哈市", "格尔木市", "乌兰县", "都兰县", "天峻县"]);
dsy.add("0_28", ["西宁市", "海东地区", "海北州", "海南州", "黄南州", "果洛州", "玉树州", "海西州"]);
dsy.add("0_29_0", ["兴庆区", "金凤区", "西夏区", "灵武市", "永宁县",  "贺兰县"]);
dsy.add("0_29_1", ["大武口区", "惠农区", "平罗县"]);
dsy.add("0_29_2", ["利通区", "青铜峡市", "盐池县","同心县"]);
dsy.add("0_29_3", ["原州区", "西吉县", "隆德县", "泾源县","彭阳县"]);
dsy.add("0_29_4", ["沙坡头区", "中宁县", "海原县"]);
dsy.add("0_29", ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"]);
dsy.add("0_30_0", ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "东山区", "乌鲁木齐县", "乌鲁木齐市水磨沟区"]);
dsy.add("0_30_1", ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区"]);
dsy.add("0_30_2", ["石河子市", "阿拉尔市", "图木舒克市", "五家渠市"]);
dsy.add("0_30_3", ["喀什市", "疏附县", "疏勒县",  "英吉沙县",  "泽普县", "莎车县","叶城县", "麦盖提县",  "岳普湖县", "伽师县", "巴楚县",  "塔什库尔干塔吉克自治县"]);
dsy.add("0_30_4", ["阿克苏市", "温宿县",  "库车县",  "沙雅县",  "新和县",  "拜城县", "乌什县","阿瓦提县", "柯坪县"]);
dsy.add("0_30_5", ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县","民丰县"]);
dsy.add("0_30_6", ["吐鲁番市", "鄯善县", "托克逊县"]);
dsy.add("0_30_7", ["哈密市", "伊吾县",  "巴里坤哈萨克自治县"]);
dsy.add("0_30_8", ["阿图什市", "阿克陶县", "阿合奇县","乌恰县"]);
dsy.add("0_30_9", ["博乐市", "精河县", "温泉县"]);
dsy.add("0_30_10", ["昌吉市", "阜康市", "米泉市", "呼图壁县","玛纳斯县", "奇台县", "吉木萨尔县",  "木垒哈萨克自治县"]);
dsy.add("0_30_11", ["库尔勒市", "轮台县", "尉犁县","若羌县","且末县",  "和静县","和硕县",  "博湖县","焉耆回族自治县"]);
dsy.add("0_30_12", ["伊宁市", "奎屯市", "伊宁县", "霍城县","巩留县",  "新源县", "昭苏县",  "特克斯县",  "尼勒克县",  "察布查尔锡伯自治县"]);
dsy.add("0_30_13", ["塔城市", "乌苏市", "额敏县",  "沙湾县", "托里县","裕民县",  "和布克赛尔蒙古自治县"]);
dsy.add("0_30_14", ["阿勒泰市", "布尔津县", "富蕴县",  "福海县", "哈巴河县", "青河县", "吉木乃县"]);
dsy.add("0_30", ["乌鲁木齐市", "克拉玛依市", "自治区直辖县级行政单位", "喀什地区", "阿克苏地区", "和田地区", "吐鲁番地区", "哈密地区", "克孜勒苏柯州", "博尔塔拉州", "昌吉州", "巴音郭楞州", "伊犁州", "塔城地区", "阿勒泰地区"]);

dsy.add("0_31_0", ["中西区", "东区", "九龙城区", "观塘区", "南区", "深水埗区", "湾仔区", "黄大仙区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区", "沙田区", "屯门区", "大埔区", "荃湾区", "元朗区"]);
dsy.add("0_31", ["香港特别行政区"]);
dsy.add("0_32_0", ["澳门特别行政区"]);
dsy.add("0_32", ["澳门特别行政区"]);
dsy.add("0_33_0", [" "]);
dsy.add("0_33", ["台北", "高雄", "台中", "花莲", "基隆", "嘉义", "金门", "连江", "苗栗", "南投", "澎湖", "屏东", "台东", "台南", "桃园", "新竹", "宜兰", "云林", "彰化"]);



dsy.add("0", ["北京市", "天津市", "上海市", "重庆市", "河北省", "山西省", "内蒙古", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西省", "海南省", "四川省", "贵州省", "云南省", "西藏", "陕西省", "甘肃省", "青海省", "宁夏", "新疆", "香港", "澳门", "台湾省"]);

var s = ["s1", "s2", "s3"];
var opt0 = ["省", "市", "区/县"];
function setup() 
{
    for (i = 0; i < s.length - 1; i++)
	{
		document.getElementById(s[i]).onchange = new Function("change(" + (i + 1) + ");");
	}
	change(0);
}